manu1519/STM32Files/Scripts/CLOCKS/ManuFiles/main.c
/* This is a Test mode to have the Files from the STM32Cube to applied my own scripts */

#include "stm32f446xx.h"
#include "stm32f4xx_hal.h"
#include "stm32f4xx_hal_def.h"
#include "stm32f4xx_hal_rcc.h"
#include "stm32f4xx_hal_uart.h"
#include "main.h"
#include "string.h"
#include <stdint.h>
#include <sys/types.h>

#define TRUE 1
#define FALSE 0

void UART2_Init(void);
void Error_handler(void);

UART_HandleTypeDef huart2;


int main(void){

    RCC_OscInitTypeDef osc_init;
    RCC_ClkInitTypeDef clk_init;
    HAL_Init();
    UART2_Init();

    /*Setting the variables for the APIs*/
    memset(&osc_init, 0, sizeof(osc_init));
    osc_init.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    osc_init.HSEState = RCC_HSE_BYPASS;
    if (HAL_RCC_OscConfig(&osc_init) != HAL_OK) {
        Error_handler();
    }
    

    while (1);

    return 0;

}



void UART2_Init(void){

    huart2.Instance = USART2;
    huart2.Init.BaudRate = 115200;
    huart2.Init.WordLength = UART_WORDLENGTH_8B;
    huart2.Init.StopBits = UART_STOPBITS_1;
    huart2.Init.Parity = UART_PARITY_NONE;
    huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    huart2.Init.Mode = UART_MODE_TX_RX;
    if (HAL_UART_Init(&huart2) != HAL_OK )
    {
        //There is a problem
        Error_handler();
    }
    
}

void Error_handler(void)
{
    while(1);
}